app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations"
---
  def index
    @conversations = Conversation.all

DELETE FROM "conversations" WHERE "conversations"."id" = ?  [["id", 1]]
---
  def destroy
    @conversation.destroy

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_conversation
      @conversation = Conversation.find(params[:id])