app/controllers/councilors_controller.rb

  def index
    @councilors = Councilor.all
---
SELECT "councilors".* FROM "councilors"