app/controllers/helpmate_controller.rb

SELECT "pforms".* FROM "pforms"
---
	def index
		@pforms = Pform.all