app/controllers/helpmate_controller.rb

	def showconcern
		@user = User.find(params[:hereid])
		@student = Student.find(params[:stuid])
		@concern = Conversation.find(params[:convid])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

	def newconcern
		@user = User.find(params[:hereid])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

	def createconcern
		@user = User.find(params[:hereid])
		@concern = Conversation.new
		@students = Student.where("user_id = ?", @user.id).first
		@concern.conv_topic = params[:concern_topic]
		@concern.post_date = params[:datepost]
		@concern.student_id = @students.id
		@concern.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE (user_id = 9) ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "conversations" ("conv_topic", "post_date", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["conv_topic", "Hello"], ["post_date", 2017-03-08 00:00:00 UTC], ["student_id", 4], ["created_at", 2017-03-23 13:14:05 UTC], ["updated_at", 2017-03-23 13:14:05 UTC]]

	def createuser
		@users = User.new
		@students = Student.new
		@councilor = Councilor.new

		@users.username = params[:user][:username]
		@users.password = params[:user][:password]
		@users.user_type = params[:user][:user_type]
		@users.save

		if(@users.user_type == "student") then
			@students.fname = params[:fname]
			@students.mi = params[:mi]
			@students.lname = params[:lname]
			@students.user_id = @users.id
			@students.save

		elsif(@users.user_type = "staff") then
			@councilor.fname = params[:fname]
			@councilor.mi = params[:mi]
			@councilor.lname = params[:lname]
			@councilor.department = params[:department]
			@councilor.user_id = @users.id
			@councilor.save
---
INSERT INTO "users" ("username", "password", "user_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Czar"], ["password", "bragas"], ["user_type", "student"], ["created_at", 2017-03-23 05:20:13 UTC], ["updated_at", 2017-03-23 05:20:13 UTC]]
INSERT INTO "students" ("fname", "mi", "lname", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["fname", "Czar"], ["mi", "N"], ["lname", "Bragas"], ["user_id", 6], ["created_at", 2017-03-23 05:20:13 UTC], ["updated_at", 2017-03-23 05:20:13 UTC]]
INSERT INTO "councilors" ("fname", "mi", "lname", "department", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["fname", "Helimar"], ["mi", ""], ["lname", "Rabago"], ["department", "DCS"], ["user_id", 10], ["created_at", 2017-03-23 14:14:17 UTC], ["updated_at", 2017-03-23 14:14:17 UTC]]

	def concern
		@user = User.find(params[:hereid])
		@conversations = Conversation.where("id = ? ", @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE (id = '9' )

	def getpform

		@user = User.new
		@user = User.find(params[:hereid])
		@student = Student.new
		@student = Student.where("user_id = ?", @user.id).first
		@pform = Pform.where("student_id = ?", @student.id).first
---
SELECT  "users".* FROM "users" WHERE (id = '6') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE (user_id = '6') ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "pforms".* FROM "pforms" WHERE (student_id = 1) ORDER BY "pforms"."id" ASC LIMIT ?  [["LIMIT", 1]]

	def identify
		@users = User.new
		@users = User.where("username = ? and password = ?", params[:username], params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."username" IS NULL AND "users"."password" IS NULL ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]

	def student
        @user = User.new
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def staff
		@user = User.new
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

	def newrec
		@user = User.new
		@user = User.find(params[:hereid])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def createrec
		@users = User.new
		@users = User.find(params[:usr_id])
		#Personal Information Form
		@pform = Pform.new()
		@pform.fname = params[:pform][:fname]
		@pform.mi = params[:pform][:mi]
		@pform.lname = params[:pform][:lname]
		@pform.coursemajor = params[:pform][:coursemajor]
		@pform.student_id = params[:pform][:student_id]
		@pform.year_level = params[:pform][:year_level]
		@pform.photoloc = params[:pform][:photoloc]
		@pform.perm_address = params[:pform][:perm_address]
		@pform.pres_address = params[:pform][:pres_address]
		@pform.contact_no = params[:pform][:contact_no]
		@pform.email = params[:pform][:email]
		@pform.birth_date = params[:pform][:birth_date]
		@pform.age = params[:pform][:age]
		@pform.sex = params[:pform][:sex]
		@pform.p_of_birth = params[:pform][:p_of_birth]
		@pform.student_id = params[:stu_id]
		@pform.nationality = params[:pform][:nationality]
		@pform.civil_stat = params[:pform][:civil_stat]
		@pform.admis_type = params[:pform][:admis_type]
		@pform.emp_name = params[:pform][:emp_name]
		@pform.emp_addr = params[:pform][:emp_addr]
		@pform.emp_cont_no = params[:pform][:emp_cont_no]
		@pform.yr_w_emp = params[:pform][:yr_w_emp]
		@pform.faveplace = params[:pform][:faveplace]
		@pform.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "pforms" ("fname", "mi", "lname", "coursemajor", "student_id", "year_level", "perm_address", "pres_address", "contact_no", "email", "birth_date", "age", "sex", "p_of_birth", "nationality", "civil_stat", "admis_type", "emp_name", "emp_addr", "emp_cont_no", "faveplace", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

		@contact_emergs.contact_no = params[:contact_no]
		@contact_emergs.email_add = params[:email_add]
		@contact_emergs.pform_id = @pform.id
		@contact_emergs.save
---
INSERT INTO "contact_emergs" ("name", "relate", "addr", "contact_no", "email_add", "pform_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["relate", ""], ["addr", ""], ["contact_no", ""], ["email_add", ""], ["pform_id", 48], ["created_at", 2017-03-22 22:25:10 UTC], ["updated_at", 2017-03-22 22:25:10 UTC]]

		@other_infos.n_condition = params[:condition]
		@other_infos.condition_temp = params[:con]
		@other_infos.pform_id = @pform.id
		@other_infos.save
---
INSERT INTO "educ_infos" ("school_addr", "recogawards", "educ_type", "pform_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["school_addr", ""], ["recogawards", ""], ["educ_type", "Elementary"], ["pform_id", 48], ["created_at", 2017-03-22 22:25:10 UTC], ["updated_at", 2017-03-22 22:25:10 UTC]]
INSERT INTO "other_infos" ("n_condition", "condition_temp", "pform_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["n_condition", ""], ["condition_temp", ""], ["pform_id", 48], ["created_at", 2017-03-22 22:25:10 UTC], ["updated_at", 2017-03-22 22:25:10 UTC]]

		@parents = []

		2.times do
			@parents << ParentInfo.new
---
INSERT INTO "parent_infos" ("name", "relate", "birth_date", "age", "religion", "nationality", "present_add", "educ_attain", "occp", "emp_name", "emp_addr", "freqInteract", "civil_stat", "pform_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

		@siblings = []

		4.times do
			@siblings << Sibling.new
---
INSERT INTO "siblings" ("name", "civil_stat", "schooloremp", "yrlvloroccp", "pform_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["civil_stat", ""], ["schooloremp", ""], ["yrlvloroccp", ""], ["pform_id", 39], ["created_at", 2017-03-19 04:46:47 UTC], ["updated_at", 2017-03-19 04:46:47 UTC]]