app/controllers/parent_infos_controller.rb

  def index
    @parent_infos = ParentInfo.all
---
SELECT "parent_infos".* FROM "parent_infos"

  def destroy
    @parent_info.destroy
---
DELETE FROM "parent_infos" WHERE "parent_infos"."id" = ?  [["id", 1]]

    def set_parent_info
      @parent_info = ParentInfo.find(params[:id])
---
SELECT  "parent_infos".* FROM "parent_infos" WHERE "parent_infos"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]