app/controllers/siblings_controller.rb

  def index
    @siblings = Sibling.all
---
SELECT "siblings".* FROM "siblings"

  def destroy
    @sibling.destroy
---
DELETE FROM "siblings" WHERE "siblings"."id" = ?  [["id", 1]]

    def set_sibling
      @sibling = Sibling.find(params[:id])
---
SELECT  "siblings".* FROM "siblings" WHERE "siblings"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]