app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "user_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "just"], ["password", "12345"], ["user_type", "student"], ["created_at", 2017-03-22 20:31:35 UTC], ["updated_at", 2017-03-22 20:31:35 UTC]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save