app/views/helpmate/concern.html.erb

  <tbody>
  <% @student = Student.where("user_id = ?", params[:hereid]).first %>
    <% @student.conversations.each do |conversation| %>
---
SELECT  "students".* FROM "students" WHERE (user_id = 'hereid') ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."student_id" = ?  [["student_id", 4]]