app/views/helpmate/getpform.html.erb

SELECT "educ_infos".* FROM "educ_infos" WHERE "educ_infos"."pform_id" = ?  [["pform_id", 56]]
SELECT "parent_infos".* FROM "parent_infos" WHERE "parent_infos"."pform_id" = ?  [["pform_id", 52]]
---
<h1> Parent Information </h1>
<% @pform.parent_infos.each do |p| %>

SELECT "siblings".* FROM "siblings" WHERE "siblings"."pform_id" = ?  [["pform_id", 56]]
---
  <h1> Sibling Section </h1>
      <% @pform.siblings.each do |s| %>