app/views/helpmate/newrec.html.erb

SELECT  "students".* FROM "students" WHERE (user_id = 6) ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
---

<% @studentid = Student.where("user_id = ?", @user.id).first %>