app/views/helpmate/student.html.erb

<p><a href = "/helpmate"> Log Out </a></p>
<% @studentrec = Student.where("user_id = ?", @user.id).first %>
<% if (!@studentrec.pform.present?) %>
---
SELECT  "students".* FROM "students" WHERE (user_id = 6) ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "pforms".* FROM "pforms" WHERE "pforms"."student_id" = ? LIMIT ?  [["student_id", 1], ["LIMIT", 1]]